# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите вариант решения: через dict.
#
# Пример:
# Введите номер месяца: 10
# Результат через список: Осень
# Результат через словарь: Осень

dict = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето", 9: "Осень",
        10: "Осень", 11: "Осень", 12: "Зима"}
month = int(input("Введите номер месяца: "))
if month in range(1, 13):
    i = dict[month]
    print(i)
else:
    print('Введен некорректный номер месяца!')


